# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv10 object detection model. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
ch: 6
dual_stream: True
siamese: True
scales: # model compound scaling constants, i.e. 'model=yolov10n.yaml' will call yolov10.yaml with scale 'n'
  # [depth, width, max_channels]
  x: [1.00, 1.25, 512]
synchronize: [[2,14],[3,15],[4,16],[5,17],[6,18],[7,19],[8,20],[9,21],[10,22],[11,23],[12,24]]


backbone:
  # [from, repeats, module, args]
  - [ -1, 1, Silence, [ ] ] #0
  - [-1 , 1, Input, [0]] #1
  - [-1, 1, Conv, [64, 3, 2]] # 2-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 3-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 5-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, SCDown, [512, 3, 2]] # 7-P4/16
  - [-1, 6, C2fCIB, [512, True]]
  - [-1, 1, SCDown, [1024, 3, 2]] # 9-P5/32
  - [-1, 3, C2fCIB, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 11
  - [-1, 1, PSA, [1024]] # 12
  # second backbone
  - [ 0, 1, Input, [ 1 ] ] #13
  - [ -1, 1, Conv, [ 64, 3, 2 ] ] # 14-P1/2
  - [ -1, 1, Conv, [ 128, 3, 2 ] ] # 15-P2/4
  - [ -1, 3, C2f, [ 128, True ] ]
  - [ -1, 1, Conv, [ 256, 3, 2 ] ] # 17-P3/8
  - [ -1, 6, C2f, [ 256, True ] ]
  - [ -1, 1, SCDown, [ 512, 3, 2 ] ] # 19-P4/16
  - [ -1, 6, C2fCIB, [ 512, True ] ]
  - [ -1, 1, SCDown, [ 1024, 3, 2 ] ] # 21-P5/32
  - [ -1, 3, C2fCIB, [ 1024, True ] ]
  - [ -1, 1, SPPF, [ 1024, 5 ] ] # 23
  - [ -1, 1, PSA, [ 1024 ] ] # 24

#neck
  - [[6, 18], 1, FeatureFusionBlock, []] #25 fused 6 and 18 former 4
  - [[8, 20], 1, FeatureFusionBlock, []] #26 fused 8 and 20 #former 6
  - [[12, 24], 1, FeatureFusionBlock, []] #27 fused  12 and 24 former 10
# YOLOv10.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #28
  - [[-1, 26], 1, Concat, [1]] # cat backbone P4 # former 6
  - [-1, 3, C2fCIB, [512, True]] # 30

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #31
  - [[-1, 25], 1, Concat, [1]] # cat backbone P3 former 4 #32
  - [-1, 3, C2f, [256]] # 16 (P3/8-small) #33 former 16

  - [-1, 1, Conv, [256, 3, 2]] #34
  - [[-1, 30], 1, Concat, [1]] # cat head P4 former 13 #35
  - [-1, 3, C2fCIB, [512, True]] # 19 (P4/16-medium) #36 former 19

  - [-1, 1, SCDown, [512, 3, 2]] #37
  - [[-1, 27], 1, Concat, [1]] # cat head P5 #former 10 #38
  - [-1, 3, C2fCIB, [1024, True]] # 22 (P5/32-large) #39 former 22

  - [[33, 36, 39], 1, v10Detect, [nc]] # Detect(P3, P4, P5) former 16, 19 ,22
